# § Chapter 5 Getting Started with pandas

- contains data structures and data manipulation tools designed to make *ata cleaning* and *analysis* fast and easy in Python. 
- often used in tandem with 
    - *numerical computing tools*like NumPy and SciPy, 
    - *analytical libraries* like statsmodels and scikit-learn, and 
    - *data visualization libraries* like matplotlib.

## §5.1 Introduction to pandas Data Structures
-	Series
-	DataFrame
-	Index Objects

## §5.2 Essential Functionality
-	Reindexing
-	Dropping Entries from an Axis
-	Indexing, Selection, and Filtering
-   Integer Indexes
-   Arithmetic and Data Alignment
-   Function Application and Mapping
-   Sorting and Ranking
-   Axis Indexes with Duplicate Labels

## §5.3 Summarizing and Computing Descriptive Statistics
-	Correlation and Covariance
-	Unique Values, Value Counts, and Membership

In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
import numpy as np
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.set_printoptions(precision=4, suppress=True)

## §5.1 Introduction to pandas Data Structures
-	Series
-	DataFrame
-	Index Objects

### § 5.1.1 Series

A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index.

In [4]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [6]:
obj.index  # like range(4)

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [12]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [13]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
# by dictionary
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [18]:
# construct a series out of an existing series
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [20]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [21]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [22]:
# merge serieses
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [24]:
# 有共同欄位台可以作運算
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
obj4.name

In [26]:
obj4.index.name

In [27]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [28]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [29]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [30]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### § 5.1.2  DataFrame

A DataFrame represents a rectangular table of data and contains an ordered collection
of columns, each of which can be a different value type (numeric, string,
boolean, etc.).

每一個 column 就是一個 series

In [71]:
# looks like a dictionary, with a list as values; all lists are of the same lenght
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [72]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [73]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [74]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [75]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [76]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [78]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [79]:
type(frame2['state'])

pandas.core.series.Series

In [80]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [81]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

↑ 以上是取整直欄，↓ 取某一橫列

In [83]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [84]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [85]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [86]:
frame2['debt'] = np.arange(6.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [87]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [88]:
frame2['debt']

one      0.0
two      1.0
three    2.0
four     3.0
five     4.0
six      5.0
Name: debt, dtype: float64

In [89]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [91]:
#expected error
# frame2['eastern']

In [92]:
frame2.state == 'Ohio'

one       True
two       True
three     True
four     False
five     False
six      False
Name: state, dtype: bool

In [93]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [94]:
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

↓ If the *nested dict* is passed to the DataFrame, pandas will interpret the outer dict keys as the columns and the inner keys as the row indices:

In [95]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [96]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [97]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [98]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [99]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [100]:
frame3['Ohio'][:-1]

2001    1.7
2002    3.6
Name: Ohio, dtype: float64

In [42]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [101]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [102]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [103]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [104]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

### § 5.1.3 Index Objects

pandas’s Index objects are responsible for holding the axis labels and other metadata
(like the axis name or names).

In [105]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [106]:
type(index)

pandas.core.indexes.base.Index

In [108]:
# 可以使用 implicit index (即從 0 開始的數字的 index)
index[1:]

Index(['b', 'c'], dtype='object')

In [48]:
index[1]

'b'

In [109]:
# expected error
index[1] = 'd'

TypeError: Index does not support mutable operations

In [110]:
labels = pd.Index(np.arange(3))
labels
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [111]:
obj2.index is labels

True

In [112]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [113]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [114]:
'Ohio' in frame3.columns

True

In [115]:
2003 in frame3.index

False

In [116]:
2000 in frame3.index

True

In [117]:
# a pandas Index can contain duplicate labels:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## §5.2 Essential Functionality
-	Reindexing
-	Dropping Entries from an Axis
-	Indexing, Selection, and Filtering
-   Integer Indexes
-   Arithmetic and Data Alignment
-   Function Application and Mapping: appyl(), applymap(), map()
-   Sorting and Ranking
-   Axis Indexes with Duplicate Labels

### § 5.2.1 Reindexing

In [118]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [120]:
# 按指定的 index 對原 idexed pair 重新排列
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [173]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

↓ For ordered data like time series, it may be desirable to do some interpolation or filling
of values when reindexing. The method option allows us to do this, using a
method such as ffill, which forward-fills the values:

In [174]:
obj3.reindex(range(6))

0      blue
1       NaN
2    purple
3       NaN
4    yellow
5       NaN
dtype: object

In [175]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [176]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index=['a', 'c', 'd'],
                     columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [177]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [179]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [180]:
# Utah 是新跑出來的
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [181]:
#you can reindex by loc for the existing index
states = ['Texas', 'California','Ohio']
frame.loc[['a', 'c', 'd'], states]

   Texas  California  Ohio
a      1           2     0
c      4           5     3
d      7           8     6

In [182]:
# ？這跟課本上寫的不太一樣！ p 137？
#error: index don't exist
frame.loc[['a', 'b', 'c', 'd'], states]

KeyError: "['b'] not in index"

### § 5.2.2 Dropping Entries from an Axis

In [183]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [184]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [185]:
# drop() 並非 inplace operation
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [186]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [189]:
# expected error
new_obj.drop(['d', 'c'])

KeyError: "['c'] not found in axis"

In [190]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [191]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [192]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [194]:
# expected error
# data.drop('two')

In [195]:
# 但如果是要 刪除 直欄
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [196]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [197]:
# 運算的結果並不會取代原 data frame
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [198]:
# 如果要取代的話，就設定 inplace = True 的旗標
obj.drop('c', inplace=True)

In [199]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

### § 5.2.3 Indexing, Selection, and Filtering

In [200]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [201]:
obj['b']

1.0

In [202]:
#即使 index 有名字，但仍可以用 看不見的排序 index
obj[1]

1.0

In [203]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [204]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [205]:
# 選出你要的
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [206]:
# filtering
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [207]:
# inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [208]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [209]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [210]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [211]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [212]:
# 不包含了！
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [213]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [214]:
data['three'] > 5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [215]:
# filtering
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [216]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [217]:
data[data < 5] = 0

In [218]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc (橫列)

In [219]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [220]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [221]:
type(data.loc['Colorado'])

pandas.core.series.Series

In [222]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [224]:
# 不使用名字，而是使用編號 → iloc()
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [225]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [226]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [227]:
# every index up and inclduing 'Utah', and take out only the 'two' column content
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [228]:
# 不包括
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [229]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [230]:
# actually, you can also use implicit index for column!
data.iloc[:, :3]

          one  two  three
Ohio        0    0      0
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### § 5.2.4 Integer Indexes

```python
ser = pd.Series(np.arange(3.))
ser
ser[-1]
```

In [231]:
ser = pd.Series(np.arange(3.))

In [232]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [233]:
#error
#如果是使用數字的 index則不行用倒數的 index
ser[-1]

KeyError: -1

In [234]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [235]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [236]:
ser2[-1]

2.0

In [237]:
ser[:1]

0    0.0
dtype: float64

In [238]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [239]:
ser.iloc[:1]

0    0.0
dtype: float64

### § 5.2.5 Arithmetic and Data Alignment

In [240]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [241]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=['a', 'c', 'e', 'f', 'g'])
s1
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [242]:
# 有欠值的 series 物件的運算
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [243]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                   index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                   index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [244]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [245]:
# 一定要在兩個表中都有定義的值才可以作相加的動作，否則以末定視之，而給 NaN 的結論
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [246]:
# 同樣的，要是「欄」有欠項也是會回報 NaN
df1 = pd.DataFrame({'A': [1, 2]})
df2 = pd.DataFrame({'B': [3, 4]})
df1

   A
0  1
1  2

In [247]:
df2

   B
0  3
1  4

In [248]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

#### Arithmetic methods with fill values

有欠項的話，塞 0 計算

In [249]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list('abcd')) # 將字串用 list 簡易化解為… list
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [250]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [251]:
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [252]:
df1
# df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [253]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [254]:
# df1 + df2 但對待 NaN 的方式不一樣
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [255]:
#a 對稱的關係
df2.add(df1, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [256]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [257]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [259]:
#a
df1.div(1)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [258]:
# r for Reverse
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [260]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [261]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [262]:
df1.reindex(columns=df2.columns)

     a    b     c     d   e
0  0.0  1.0   2.0   3.0 NaN
1  4.0  5.0   6.0   7.0 NaN
2  8.0  9.0  10.0  11.0 NaN

In [263]:
# 當發生欠項時的補值
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### Operations between DataFrame and Series

注意運算的方向，還有廣播 (維次不同時)

In [264]:
# 回想在 ndarray 時的作法
arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [265]:
type(arr)

numpy.ndarray

In [266]:
arr[0]

array([0., 1., 2., 3.])

In [267]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [268]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [269]:
series = frame.iloc[0]

In [270]:
frame
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [271]:
# frame - series，是把 series 廣播到 frame 的每一列
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [272]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [273]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [274]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [276]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [277]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [278]:
frame - series3

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [279]:
# sub 是減法；axis 指的是減法是以整欄的方向移動
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

## <span style="color:blue">§ 5.2.6 Function Application and Mapping</span>

In [280]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429 -2.001637 -0.371843
Texas   1.669025 -0.438570 -0.539741
Oregon  0.476985  3.248944 -1.021228

In [281]:
# 使用 numpy 的函式來運算 pd 的元忲
np.abs(frame)

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429  2.001637  0.371843
Texas   1.669025  0.438570  0.539741
Oregon  0.476985  3.248944  1.021228

In [282]:
# Apply a function along an axis of the DataFrame.
# 預設 axis = 0 即 row 的方向，往下↓
frame.apply?

In [284]:
frame

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429 -2.001637 -0.371843
Texas   1.669025 -0.438570 -0.539741
Oregon  0.476985  3.248944 -1.021228

In [285]:
f = lambda x: x.max() - x.min()
frame.apply(f) # 沿著 row 的方向

b    1.394034
d    5.250581
e    2.374144
dtype: float64

In [286]:
frame.apply(f, axis='columns')

Utah      1.124004
Ohio      2.888067
Texas     2.208767
Oregon    4.270171
dtype: float64

In [287]:
frame

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429 -2.001637 -0.371843
Texas   1.669025 -0.438570 -0.539741
Oregon  0.476985  3.248944 -1.021228

In [288]:
# 針對每一行，作針對整個 column 作 f(x)，也就是沿著 axis = 0 ROW 的方向作運算
# 回傳一個 series, 其 index 為…
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min  0.274992 -2.001637 -1.021228
max  1.669025  3.248944  1.352917

In [289]:
frame.apply(f, axis='columns')

             min       max
Utah    0.228913  1.352917
Ohio   -2.001637  0.886429
Texas  -0.539741  1.669025
Oregon -1.021228  3.248944

In [290]:
# Apply a function to a Dataframe elementwise.
frame.applymap?

In [291]:
frame

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429 -2.001637 -0.371843
Texas   1.669025 -0.438570 -0.539741
Oregon  0.476985  3.248944 -1.021228

In [292]:
format = lambda x: '%.2f' % x
frame.applymap(format)

           b      d      e
Utah    0.27   0.23   1.35
Ohio    0.89  -2.00  -0.37
Texas   1.67  -0.44  -0.54
Oregon  0.48   3.25  -1.02

In [293]:
frame['e']

Utah      1.352917
Ohio     -0.371843
Texas    -0.539741
Oregon   -1.021228
Name: e, dtype: float64

In [294]:
# Make an iterator that computes the function using arguments from each of the iterables.  
frame['e'].map?

In [295]:
frame['e'].map

<bound method Series.map of Utah      1.352917
Ohio     -0.371843
Texas    -0.539741
Oregon   -1.021228
Name: e, dtype: float64>

In [296]:
type(frame['e'])

pandas.core.series.Series

In [297]:
frame['e'].map(format)

Utah       1.35
Ohio      -0.37
Texas     -0.54
Oregon    -1.02
Name: e, dtype: object

In [299]:
#expected erro
# frame['e'].applymap(format)

In [300]:
frame['e'].apply(format)

Utah       1.35
Ohio      -0.37
Texas     -0.54
Oregon    -1.02
Name: e, dtype: object

### § 5.2.7 Sorting and Ranking

In [315]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [316]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [317]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [318]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [319]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [320]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [321]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [322]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [323]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [324]:
# NaN 是最大的！
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [325]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [326]:
# 當欄位超過一個時，要以誰為主？
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [327]:
# 看誰放在前面
frame.sort_values(by=['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [328]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [330]:
obj.values

array([ 7, -5,  7,  4,  2,  0,  4], dtype=int64)

In [135]:
# 對應 0, 2 的兩個 7，理應排名 6, 7, 取其平均值，即為 6.5
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [331]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [332]:
# Assign tie values the maximum rank in the group
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [333]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [334]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [335]:
# 注意，不是 inplace 運算
# frame

### § 5.2.8 Axis Indexes with Duplicate Labels

In [336]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [337]:
obj.index.is_unique

False

In [338]:
obj['a']

a    0
a    1
dtype: int64

In [339]:
obj['c']

4

In [340]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.577087  0.124121  0.302614
a  0.523772  0.000940  1.343810
b -0.713544 -0.831154 -2.370232
b -1.860761 -0.860757  0.560145

In [341]:
df.loc['b']

          0         1         2
b -0.713544 -0.831154 -2.370232
b -1.860761 -0.860757  0.560145

## <span style="color:blue">§ 5.3 Summarizing and Computing Descriptive Statistics</span>
-	Correlation and Covariance
-	Unique Values, Value Counts, and Membership

In [342]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [343]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [344]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [345]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [346]:
df.mean(axis='columns')

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [347]:
# 每一欄，出現最大值的 index 為何？
df.idxmax()

one    b
two    d
dtype: object

In [349]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [348]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [350]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [351]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [352]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### § 5.3.1 Correlation and Covariance

In [353]:
# https://www.synopsys.com/blogs/software-security/python-pickling/
price = pd.read_pickle('examples/yahoo_price.pkl')
volume = pd.read_pickle('examples/yahoo_volume.pkl')

In [355]:
type(price)

pandas.core.frame.DataFrame

In [152]:
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [356]:
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

以上是課本為了防患從網路上拿不到資料的作法。

以下是這些資料的來源，我試了之後，竟然可以！

### 如果要自己去取的話，先裝好：
```shell
$conda install pandas-datareader
```

```shell
$pip install pandas_datareader
```

```python
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})
```

↓ 以下先來個 dictionary 的小複習

In [357]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [358]:
data.keys()

dict_keys(['state', 'year', 'pop'])

In [359]:
data.items()

dict_items([('state', ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada']), ('year', [2000, 2001, 2002, 2001, 2002, 2003]), ('pop', [1.5, 1.7, 3.6, 2.4, 2.9, 3.2])])

In [170]:
len(data.items())

3

In [360]:
# expected error
data.items()(0)

TypeError: 'dict_items' object is not callable

In [362]:
# dictionary comprehension
{key: data for (key, data) in data.items()}

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [363]:
# 先看取單筆的資料
import pandas_datareader.data as web
web.get_data_yahoo('TSM')

,High,Low,Open,Close,Volume,Adj Close
Date,,,,,,
2016-11-01,31.200001,30.480000,31.120001,30.709999,5815800.0,26.378027
2016-11-02,30.730000,30.240000,30.670000,30.389999,5274700.0,26.103168
2016-11-03,30.500000,30.180000,30.350000,30.280001,4890800.0,26.008686
2016-11-04,30.450001,30.020000,30.209999,30.240000,4431900.0,25.974327
2016-11-07,31.379999,30.680000,30.719999,31.350000,3981800.0,26.927752
...,...,...,...,...,...,...
2021-10-25,114.550003,113.110001,114.400002,113.639999,6667700.0,113.639999
2021-10-26,115.300003,113.720001,114.940002,114.180000,4852300.0,114.180000
2021-10-27,115.059998,113.709999,114.029999,113.750000,5394500.0,113.750000
2021-10-28,116.019997,113.540001,113.660004,116.010002,5714300.0,116.010002
2021-10-29,114.190002,113.220001,114.070000,113.699997,7115100.0,113.699997

In [364]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

### [Day21]Pandas就能輕易將資料視覺化！
https://ithelp.ithome.com.tw/articles/10196571
我試了 conda 不行，
然後就試了 pip

## 用 Python pandas_datareader 抓台灣股價
http://thebacksade.blogspot.com/2017/10/python-pandasdatareader.html

In [365]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG', 'TSM']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [366]:
all_data

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2016-11-01   28.442499   27.632500   28.365000   27.872499  175303200.0
 2016-11-02   28.087500   27.807501   27.850000   27.897499  113326800.0
 2016-11-03   27.865000   27.387501   27.745001   27.457500  107730400.0
 2016-11-04   27.562500   27.027500   27.132500   27.209999  123348000.0
 2016-11-07   27.627501   27.365000   27.520000   27.602501  130240000.0
 ...                ...         ...         ...         ...          ...
 2021-10-25  149.369995  147.619995  148.679993  148.639999   50720600.0
 2021-10-26  150.839996  149.009995  149.330002  149.320007   60893400.0
 2021-10-27  149.729996  148.490005  149.360001  148.850006   56094900.0
 2021-10-28  153.169998  149.720001  149.820007  152.570007  100077900.0
 2021-10-29  149.940002  146.410004  147.220001  149.800003  124850400.0

              Adj Close
 Date
 2016-11-01   26.139957
 2016-11-02   26.163404
 2016-11-03   25.882963
 2016-11-04   25.649658
 2016-11-07   26.019650
 ...                ...
 2021-10-25  148.639999
 2021-10-26  149.320007
 2021-10-27  148.850006
 2021-10-28  152.570007
 2021-10-29  149.800003

 [1258 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2016-11-01  153.910004  151.740005  153.500000  152.789993  3191900.0
 2016-11-02  153.350006  151.669998  152.479996  151.949997  3074400.0
 2016-11-03  153.740005  151.800003  152.509995  152.369995  2878800.0
 2016-11-04  153.639999  151.869995  152.399994  152.429993  2470400.0
 2016-11-07  156.110001  153.839996  153.990005  155.720001  3804900.0
 ...                ...         ...         ...         ...        ...
 2021-10-25  128.649994  126.940002  127.529999  127.639999  6374000.0
 2021-10-26  128.300003  126.760002  127.519997  127.129997  8520900.0
 2021-10-27  127.879997  125.010002  127.440002  125.169998  6973400.0
 2021-10-28  126.309998  124.620003  125.169998  125.839996  6503000.0
 2021-10-29  126.320000  124.910004  125.430000  125.099998  5915900.0

              Adj Close
 Date
 2016-11-01  121.990822
 2016-11-02  121.320122
 2016-11-03  121.655502
 2016-11-04  121.703354
 2016-11-07  124.330154
 ...                ...
 2021-10-25  127.639999
 2021-10-26  127.129997
 2021-10-27  125.169998
 2021-10-28  125.839996
 2021-10-29  125.099998

 [1258 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2016-11-01   60.020000   59.250000   59.970001   59.799999  24533000.0
 2016-11-02   59.930000   59.299999   59.820000   59.430000  22147000.0
 2016-11-03   59.639999   59.110001   59.529999   59.209999  21600400.0
 2016-11-04   59.279999   58.520000   58.650002   58.709999  28697000.0
 2016-11-07   60.520000   59.779999   59.779999   60.419998  31664800.0
 ...                ...         ...         ...         ...         ...
 2021-10-25  309.399994  306.459991  309.359985  308.130005  17554500.0
 2021-10-26  312.399994  308.600006  311.000000  310.109985  28107300.0
 2021-10-27  326.100006  316.000000  316.000000  323.170013  52588700.0
 2021-10-28  324.869995  321.359985  324.329987  324.350006  26297900.0
 2021-10-29  332.000000  323.899994  324.130005  331.619995  34744900.0

              Adj Close
 Date
 2016-11-01   55.328682
 2016-11-02   54.986343
 2016-11-03   54.782784
 2016-11-04   54.320175
 2016-11-07   55.902313
 ...                ...
 2021-10-25  308.130005
 2021-10-26  310.109985
 2021-10-27  323.170013
 2021-10-28  324.350006
 2021-10-29  331.619995

 [1258 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2016-11-01   789.489990   775.539978   782.890015   783.609985  2406400
 2016-11-02   781.650024   763.450012   778.200012   768.700012  1872400
 2016-11-03   769.950012   759.030029   767.250000   762.130005  1943200
 2016-11-04   770.359985   750.560974   750.659973   762.020020  2134800
 2016-11-07   785.190002   772.549988   774.500000   782.520020  1585100
 ...                 ...          ...          ...          ...      ...
 2021-10-25  2784.115967  2734.969971  2776.209961  2775.459961  1054100
 2021-10-26  2816.790039  2780.110107  2812.120117  2793.439941  1412900
 2021-10-27  2982.360107  2798.050049  2798.050049  2928.550049  2592500
 2021-10-28  2948.489990  2895.270020  2945.979980  2922.580078  1620900
 2021-10-29  2972.260010  2903.330078  2910.399902  2965.409912  1447300

               Adj Close
 Date
 2016-11-01   783.609985
 2016-11-02   768.700012
 2016-11-03   762.130005
 2016-11-04   762.020020
 2016-11-07   782.520020
 ...                 ...
 2021-10-25  2775.459961
 2021-10-26  2793.439941
 2021-10-27  2928.550049
 2021-10-28  2922.580078
 2021-10-29  2965.409912

 [1258 rows x 6 columns],
 'TSM':                   High         Low        Open       Close     Volume  \
 Date
 2016-11-01   31.200001   30.480000   31.120001   30.709999  5815800.0
 2016-11-02   30.730000   30.240000   30.670000   30.389999  5274700.0
 2016-11-03   30.500000   30.180000   30.350000   30.280001  4890800.0
 2016-11-04   30.450001   30.020000   30.209999   30.240000  4431900.0
 2016-11-07   31.379999   30.680000   30.719999   31.350000  3981800.0
 ...                ...         ...         ...         ...        ...
 2021-10-25  114.550003  113.110001  114.400002  113.639999  6667700.0
 2021-10-26  115.300003  113.720001  114.940002  114.180000  4852300.0
 2021-10-27  115.059998  113.709999  114.029999  113.750000  5394500.0
 2021-10-28  116.019997  113.540001  113.660004  116.010002  5714300.0
 2021-10-29  114.190002  113.220001  114.070000  113.699997  7115100.0

              Adj Close
 Date
 2016-11-01   26.378031
 2016-11-02   26.103167
 2016-11-03   26.008686
 2016-11-04   25.974327
 2016-11-07   26.927753
 ...                ...
 2021-10-25  113.639999
 2021-10-26  114.180000
 2021-10-27  113.750000
 2021-10-28  116.010002
 2021-10-29  113.699997

 [1258 rows x 6 columns]}

In [367]:
type(all_data)

dict

In [368]:
all_data.keys()

dict_keys(['AAPL', 'IBM', 'MSFT', 'GOOG', 'TSM'])

In [369]:
all_data.items()

dict_items([('AAPL',                   High         Low        Open       Close       Volume  \
Date
2016-11-01   28.442499   27.632500   28.365000   27.872499  175303200.0
2016-11-02   28.087500   27.807501   27.850000   27.897499  113326800.0
2016-11-03   27.865000   27.387501   27.745001   27.457500  107730400.0
2016-11-04   27.562500   27.027500   27.132500   27.209999  123348000.0
2016-11-07   27.627501   27.365000   27.520000   27.602501  130240000.0
...                ...         ...         ...         ...          ...
2021-10-25  149.369995  147.619995  148.679993  148.639999   50720600.0
2021-10-26  150.839996  149.009995  149.330002  149.320007   60893400.0
2021-10-27  149.729996  148.490005  149.360001  148.850006   56094900.0
2021-10-28  153.169998  149.720001  149.820007  152.570007  100077900.0
2021-10-29  149.940002  146.410004  147.220001  149.800003  124850400.0

             Adj Close
Date
2016-11-01   26.139957
2016-11-02   26.163404
2016-11-03   25.882963
2016-11-04   25.649658
2016-11-07   26.019650
...                ...
2021-10-25  148.639999
2021-10-26  149.320007
2021-10-27  148.850006
2021-10-28  152.570007
2021-10-29  149.800003

[1258 rows x 6 columns]), ('IBM',                   High         Low        Open       Close     Volume  \
Date
2016-11-01  153.910004  151.740005  153.500000  152.789993  3191900.0
2016-11-02  153.350006  151.669998  152.479996  151.949997  3074400.0
2016-11-03  153.740005  151.800003  152.509995  152.369995  2878800.0
2016-11-04  153.639999  151.869995  152.399994  152.429993  2470400.0
2016-11-07  156.110001  153.839996  153.990005  155.720001  3804900.0
...                ...         ...         ...         ...        ...
2021-10-25  128.649994  126.940002  127.529999  127.639999  6374000.0
2021-10-26  128.300003  126.760002  127.519997  127.129997  8520900.0
2021-10-27  127.879997  125.010002  127.440002  125.169998  6973400.0
2021-10-28  126.309998  124.620003  125.169998  125.839996  6503000.0
2021-10-29  126.320000  124.910004  125.430000  125.099998  5915900.0

             Adj Close
Date
2016-11-01  121.990822
2016-11-02  121.320122
2016-11-03  121.655502
2016-11-04  121.703354
2016-11-07  124.330154
...                ...
2021-10-25  127.639999
2021-10-26  127.129997
2021-10-27  125.169998
2021-10-28  125.839996
2021-10-29  125.099998

[1258 rows x 6 columns]), ('MSFT',                   High         Low        Open       Close      Volume  \
Date
2016-11-01   60.020000   59.250000   59.970001   59.799999  24533000.0
2016-11-02   59.930000   59.299999   59.820000   59.430000  22147000.0
2016-11-03   59.639999   59.110001   59.529999   59.209999  21600400.0
2016-11-04   59.279999   58.520000   58.650002   58.709999  28697000.0
2016-11-07   60.520000   59.779999   59.779999   60.419998  31664800.0
...                ...         ...         ...         ...         ...
2021-10-25  309.399994  306.459991  309.359985  308.130005  17554500.0
2021-10-26  312.399994  308.600006  311.000000  310.109985  28107300.0
2021-10-27  326.100006  316.000000  316.000000  323.170013  52588700.0
2021-10-28  324.869995  321.359985  324.329987  324.350006  26297900.0
2021-10-29  332.000000  323.899994  324.130005  331.619995  34744900.0

             Adj Close
Date
2016-11-01   55.328682
2016-11-02   54.986343
2016-11-03   54.782784
2016-11-04   54.320175
2016-11-07   55.902313
...                ...
2021-10-25  308.130005
2021-10-26  310.109985
2021-10-27  323.170013
2021-10-28  324.350006
2021-10-29  331.619995

[1258 rows x 6 columns]), ('GOOG',                    High          Low         Open        Close   Volume  \
Date
2016-11-01   789.489990   775.539978   782.890015   783.609985  2406400
2016-11-02   781.650024   763.450012   778.200012   768.700012  1872400
2016-11-03   769.950012   759.030029   767.250000   762.130005  1943200
2016-11-04   770.359985   750.560974   750.659973   762.020020  2134800
2016-11-07   785.190002   772.549988   774.500000   782.520020  1585100
...                 ...          ...          ...          ...      ...
2021-10-25  2784.115967  2734.969971  2776.209961  2775.459961  1054100
2021-10-26  2816.790039  2780.110107  2812.120117  2793.439941  1412900
2021-10-27  2982.360107  2798.050049  2798.050049  2928.550049  2592500
2021-10-28  2948.489990  2895.270020  2945.979980  2922.580078  1620900
2021-10-29  2972.260010  2903.330078  2910.399902  2965.409912  1447300

              Adj Close
Date
2016-11-01   783.609985
2016-11-02   768.700012
2016-11-03   762.130005
2016-11-04   762.020020
2016-11-07   782.520020
...                 ...
2021-10-25  2775.459961
2021-10-26  2793.439941
2021-10-27  2928.550049
2021-10-28  2922.580078
2021-10-29  2965.409912

[1258 rows x 6 columns]), ('TSM',                   High         Low        Open       Close     Volume  \
Date
2016-11-01   31.200001   30.480000   31.120001   30.709999  5815800.0
2016-11-02   30.730000   30.240000   30.670000   30.389999  5274700.0
2016-11-03   30.500000   30.180000   30.350000   30.280001  4890800.0
2016-11-04   30.450001   30.020000   30.209999   30.240000  4431900.0
2016-11-07   31.379999   30.680000   30.719999   31.350000  3981800.0
...                ...         ...         ...         ...        ...
2021-10-25  114.550003  113.110001  114.400002  113.639999  6667700.0
2021-10-26  115.300003  113.720001  114.940002  114.180000  4852300.0
2021-10-27  115.059998  113.709999  114.029999  113.750000  5394500.0
2021-10-28  116.019997  113.540001  113.660004  116.010002  5714300.0
2021-10-29  114.190002  113.220001  114.070000  113.699997  7115100.0

             Adj Close
Date
2016-11-01   26.378031
2016-11-02   26.103167
2016-11-03   26.008686
2016-11-04   25.974327
2016-11-07   26.927753
...                ...
2021-10-25  113.639999
2021-10-26  114.180000
2021-10-27  113.750000
2021-10-28  116.010002
2021-10-29  113.699997

[1258 rows x 6 columns])])

In [370]:
type(all_data.items())

dict_items

In [371]:
type(all_data['AAPL'])

pandas.core.frame.DataFrame

In [372]:
all_data['AAPL'].columns

Index(['High', 'Low', 'Open', 'Close', 'Volume', 'Adj Close'], dtype='object')

In [373]:
all_data['AAPL'].index

DatetimeIndex(['2016-11-01', '2016-11-02', '2016-11-03', '2016-11-04',
               '2016-11-07', '2016-11-08', '2016-11-09', '2016-11-10',
               '2016-11-11', '2016-11-14',
               ...
               '2021-10-18', '2021-10-19', '2021-10-20', '2021-10-21',
               '2021-10-22', '2021-10-25', '2021-10-26', '2021-10-27',
               '2021-10-28', '2021-10-29'],
              dtype='datetime64[ns]', name='Date', length=1258, freq=None)

In [374]:
price

                  AAPL         IBM        MSFT         GOOG         TSM
Date
2016-11-01   26.139957  121.990822   55.328682   783.609985   26.378031
2016-11-02   26.163404  121.320122   54.986343   768.700012   26.103167
2016-11-03   25.882963  121.655502   54.782784   762.130005   26.008686
2016-11-04   25.649658  121.703354   54.320175   762.020020   25.974327
2016-11-07   26.019650  124.330154   55.902313   782.520020   26.927753
...                ...         ...         ...          ...         ...
2021-10-25  148.639999  127.639999  308.130005  2775.459961  113.639999
2021-10-26  149.320007  127.129997  310.109985  2793.439941  114.180000
2021-10-27  148.850006  125.169998  323.170013  2928.550049  113.750000
2021-10-28  152.570007  125.839996  324.350006  2922.580078  116.010002
2021-10-29  149.800003  125.099998  331.619995  2965.409912  113.699997

[1258 rows x 5 columns]

In [375]:
volume

                   AAPL        IBM        MSFT     GOOG        TSM
Date
2016-11-01  175303200.0  3191900.0  24533000.0  2406400  5815800.0
2016-11-02  113326800.0  3074400.0  22147000.0  1872400  5274700.0
2016-11-03  107730400.0  2878800.0  21600400.0  1943200  4890800.0
2016-11-04  123348000.0  2470400.0  28697000.0  2134800  4431900.0
2016-11-07  130240000.0  3804900.0  31664800.0  1585100  3981800.0
...                 ...        ...         ...      ...        ...
2021-10-25   50720600.0  6374000.0  17554500.0  1054100  6667700.0
2021-10-26   60893400.0  8520900.0  28107300.0  1412900  4852300.0
2021-10-27   56094900.0  6973400.0  52588700.0  2592500  5394500.0
2021-10-28  100077900.0  6503000.0  26297900.0  1620900  5714300.0
2021-10-29  124850400.0  5915900.0  34744900.0  1447300  7115100.0

[1258 rows x 5 columns]

In [376]:
price.head()

                 AAPL         IBM       MSFT        GOOG        TSM
Date
2016-11-01  26.139957  121.990822  55.328682  783.609985  26.378031
2016-11-02  26.163404  121.320122  54.986343  768.700012  26.103167
2016-11-03  25.882963  121.655502  54.782784  762.130005  26.008686
2016-11-04  25.649658  121.703354  54.320175  762.020020  25.974327
2016-11-07  26.019650  124.330154  55.902313  782.520020  26.927753

In [379]:
returns = price.pct_change()

In [380]:
# Percentage change between the current and a prior element.
price.pct_change?

In [381]:
returns.head()

                AAPL       IBM      MSFT      GOOG       TSM
Date
2016-11-01       NaN       NaN       NaN       NaN       NaN
2016-11-02  0.000897 -0.005498 -0.006187 -0.019027 -0.010420
2016-11-03 -0.010719  0.002764 -0.003702 -0.008547 -0.003620
2016-11-04 -0.009014  0.000393 -0.008444 -0.000144 -0.001321
2016-11-07  0.014425  0.021584  0.029126  0.026902  0.036706

In [382]:
returns.tail()

                AAPL       IBM      MSFT      GOOG       TSM
Date
2021-10-25 -0.000336 -0.001877 -0.003332  0.001068 -0.005165
2021-10-26  0.004575 -0.003996  0.006426  0.006478  0.004752
2021-10-27 -0.003148 -0.015417  0.042114  0.048367 -0.003766
2021-10-28  0.024992  0.005353  0.003651 -0.002039  0.019868
2021-10-29 -0.018156 -0.005880  0.022414  0.014655 -0.019912

In [383]:
returns['MSFT'].corr(returns['IBM'])

0.5034708160102148

In [384]:
returns['MSFT'].cov(returns['IBM'])

0.0001442403655145747

In [385]:
returns.MSFT.corr(returns.IBM)

0.5034708160102148

In [386]:
returns.corr()

          AAPL       IBM      MSFT      GOOG       TSM
AAPL  1.000000  0.436080  0.736865  0.661388  0.560328
IBM   0.436080  1.000000  0.503471  0.473101  0.406820
MSFT  0.736865  0.503471  1.000000  0.778909  0.566932
GOOG  0.661388  0.473101  0.778909  1.000000  0.518650
TSM   0.560328  0.406820  0.566932  0.518650  1.000000

In [387]:
returns.cov()

          AAPL       IBM      MSFT      GOOG       TSM
AAPL  0.000362  0.000138  0.000242  0.000214  0.000208
IBM   0.000138  0.000276  0.000144  0.000133  0.000131
MSFT  0.000242  0.000144  0.000298  0.000228  0.000190
GOOG  0.000214  0.000133  0.000228  0.000288  0.000171
TSM   0.000208  0.000131  0.000190  0.000171  0.000378

In [388]:
returns.corrwith(returns.IBM)

AAPL    0.436080
IBM     1.000000
MSFT    0.503471
GOOG    0.473101
TSM     0.406820
dtype: float64

In [389]:
returns.corrwith(volume)

AAPL   -0.075010
IBM    -0.137031
MSFT   -0.064742
GOOG   -0.121382
TSM     0.030970
dtype: float64

### § 5.3.2 Unique Values, Value Counts, and Membership

In [390]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [392]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [393]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [394]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [395]:
obj
mask = obj.isin(['b', 'c'])

In [396]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [397]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [398]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [399]:
unique_vals = pd.Series(['c', 'b', 'a'])
unique_vals

0    c
1    b
2    a
dtype: object

In [400]:
# 將 to_match 的每一項，對應到 unique_vals 中對應相的 index
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [401]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],
                     'Qu2': [2, 3, 1, 2, 3],
                     'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [402]:
# 在整個表中，計數所的數字的次數
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [314]:
# Compute a histogram of the counts of non-null values.
pd.value_counts?

## Conclusion

In [ ]:
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['2330.TW', '0050.TW', '2412.TW', '2317.TW']}

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [ ]:
price

In [ ]:
volume